Конечно, вот пример тестового промта для AutoDev:

```
# Задача: Напишите функцию, которая принимает на вход числовой список и возвращает среднее значение элементов списка.

def calculate_average(numbers):
    # Напишите ваш код здесь
    pass

# Тесты
assert calculate_average([1, 2, 3, 4, 5]) == 3.0, "Тест 1 не пройден"
assert calculate_average([10, 20, 30]) == 20.0, "Тест 2 не пройден"
assert calculate_average([5, 5, 5, 5, 5, 5]) == 5.0, "Тест 3 не пройден"
print("Все тесты пройдены успешно!")
```