Конечно, вот пример тестового промпта для AutoDev:

---

### Задача:

Напишите функцию `calculate_gross_salary`, которая принимает на вход два аргумента: базовую заработную плату `base_salary` и процентный бонус `bonus_percent`. Функция должна рассчитать и вернуть величину гросс заработной платы, учитывая процентный бонус.

---

### Пример использования:

```python
gross_salary = calculate_gross_salary(50000, 10)
print(gross_salary)  # ожидаемый результат: 55000
```

---

### Требования:

1. Функция должна корректно обрабатывать положительные целочисленные значения базовой заработной платы и процентного бонуса.
2. Результат должен быть округлен до целого числа.

--- 

Пожалуйста, реализуйте функцию `calculate_gross_salary` согласно указанным требованиям.